#include <stdlib.h>
#include <iostream>
#include <ctime>
#include <memory>
#include <vector>

namespace 📘 = std;
#define 🧲 using
🧲 💀 = void;
🧲 🔢 = int;
🧲 🔠 = char;
🧲 💡 = bool;

#define 🚀 main
#define 🖥️ 📘::cout
#define 🔫 📘::endl
#define 🕒 📘::time
#define 🔮 📘::srand
#define 🎱 📘::rand
#define 💪 📘::make_shared
#define 👇 📘::shared_ptr
#define 🌐 📘::vector
#define 🩲 📘::string
#define 🚗 auto
#define 👍 true
#define 👎 false
#define 🔚 RAND_MAX
#define 🕳️ nullptr
#define 🔣 enum
#define 🦄 virtual
#define 🧙 static_cast
#define 📚 template
#define 👨‍🏫 class
#define 🏢 struct
#define 🔁 const
#define 🔙 return

🔁 🔠 *😈 = "Devil";
🔁 🔠 *🌌 = " ";
🔁 🔠 *🖊️ = "code";

📚<👨‍🏫 📓>
🧲 📗 = 🌐<📓>;

📚<👨‍🏫 📓>
🧲 📙 = 👇<📓>;

🏢 🍴 {🦄 💀 👀() = 0;};
🏢 🍊 : 🍴 {🦄 💀 👀() {🖥️ << "🍊";};};
🏢 🍉 : 🍴 {🦄 💀 👀() {🖥️ << "🍉";};};
🏢 🍒 : 🍴 {🦄 💀 👀() {🖥️ << "🍒";};};
🏢 🍓 : 🍴 {🦄 💀 👀() {🖥️ << "🍓";};};
🏢 🍍 : 🍴 {🦄 💀 👀() {🖥️ << "🍍";};};
🏢 🍅 : 🍴 {🦄 💀 👀() {🖥️ << "🍅";};};

🔣 🐒 {🐵, 🙈, 🙊, 🙉};
🔁 🔠 *🍌[4] = {"🐵", "🙈", "🙊", "🙉"};

🔢 🎰(🔢 🎲 = 6, 💡 🥛 = 👎) {
  🔮(🕒(🕳️));
  🔙 (1 + 🎱() / ((🔚 + 1u) / 🎲)) + (🥛 ? -1 : 0);
}

💡 👓() {
  🔙 ((🎰(2, 👍) % 2) == 👍);
}

🔢 🚀() {
  🖥️ << "📓 " << 😈 << 🌌 << 🖊️ << " ☣️" << 🔫;
  🖥️ << 🩲(17, '-') << 🔫;
  🖥️ << "😳 : You look " << (👓() ? "😎!" : "💩!") << 🔫;
  🖥️ << "🎰 : 🎲 " << 🎰(6) << 🔫;
  🖥️ << "🐒 : " << 🍌[🧙<🐒>(🎰(4, 👍))] << 🔫;

  📗<📙<🍴>> 🍱 = {💪<🍊>(), 💪<🍉>(), 💪<🍒>(), 💪<🍓>(), 💪<🍍>(), 💪<🍅>()};
  🖥️ << "🍽️  : ";
  for (🚗 🍏 : 🍱) {
    🍏->👀();
  }
  🖥️ << 🔫;

  🔙 🎰();
}
